{"pageProps":{"tag":"Immigrant","postsForTag":[{"id":"two-arcs-of-my-immigration-story","content":"I can tell my immigration story two different ways. One, I came here with $200 and two suitcases holding almost all of my worldly possessions. Two, I came here with a full scholarship to a rich liberal arts college. Both are true, and have shaped who I am and the way I view the world. Give or take a few details, my story is not that different from that of other immigrants who came to the U.S. for higher education or white collar jobs since the post-Civil Rights era. But immigrant narratives are rife with stories with the first arc — we came here with nothing, worked hard, and succeeded, look at us now!\n\nOf course, most of us came here with very little. We started out with few worldly possessions, only what we could cram into our suitcases. We struggled to find our footing, away from family and friends. But we were among the most privileged. Even for those of us who did not come from affluence, we had enough to pay our fare or at least the social capital to be able to borrow against future income potential. That $200 and a one-way ticket almost wiped out my parents’ entire life savings. Yet, my family could afford that airfare, even if just one-way — a luxury still not available to most of the people back home.\n\nHard work definitely played a big role in my success. But, the scholarship gave me a flying start (regardless of whether you look at it as charity to save a Third World Brown girl or a more sinister agenda to undermine the Civil Rights movement by creating a buffer community). It gave me freedom and helped me save up even on a nonprofit starter salary — a luxury not available to majority of my friends from the U.S. who are still paying off their education debt.\n\nMy time in the U.S. hasn’t been all milk and honey. For more than a decade, I was constantly running an obstacle course set up by the U.S. immigration system. I spent countless number of hours gathering documents to prove my worth and tens of thousands of dollars to pay the lawyers and the U.S. government. Things fell through, and my life almost fell apart. A last minute contact with a wonderful immigration attorney saved the day, thanks to the social and financial capital I had been able to build — a luxury not available to millions of immigrants.\n\nSo, if I tell my story as coming to the U.S. with $200 and two suitcases, I would be lying, even if every single word is factually correct.","title":"Two Arcs of My Immigration Story","date":"2020-12-24T18:15:00.000Z","image":"/images/img_8065.jpeg","author":"Luna Ranjit","description":"This is meta description.","categories":[],"tags":["Essay","Immigrant"]},{"id":"voting-in-honor-of-my-father","content":"In the cool morning of November 8, 2016, I stood in line at the Joseph Pulitzer Intermediate School 145 in Jackson Heights, Queens, New York to cast the very first ballot of my life. I carefully filled out the bubbles on the ballot, thinking about my father. It had been exactly twenty-two months since he had passed.\n\nI never got to vote while my father was alive because I was not old enough while living in Nepal, my country of birth, and I did not have U.S. citizenship for the first two decades of living and working here. When I finally got my right to vote, after years of supporting others to engage in the electoral process, I was thrilled about finally being able to participate in the electoral process but not about the candidates. My vote ended up being symbolic anyway, unable to change the election results that shocked the world. I still wish I could share my experience as a first time voter with my father, my political idol who taught me by example to question the status quo and rise up for justice.\n\nOne of my earliest memories is holding my mother’s hand as she registered at two different gates on the way to visit my father in jail. He had been arrested a few days earlier, supposedly for translating into Nepali a text that the government deemed dangerous. I was too young to fully understand the details. I was just happy to see him. He came home after a few more days, but the image of speaking to him through the bars has stayed with me all these years. I also remember smugly judging the guards for misspelling my mother’s name, turning Panna, an emerald, into tanna, a bedsheet.\n\nIt was not the first time my father had suffered from state-sanctioned violence. As a teenager, he walked out of classes to march in the streets of Kathmandu for democracy, for people’s right to choose who governs them. He was apparently hit by a rubber bullet during one of the marches, and lived with recurring pain for many years.\n\nBut jail and injury was not enough to wipe out his radical hope. He dedicated his life to ensure that voices from the margins were heard. He went on to do transnational work through Afro-Asian people’s solidarity movement, while continuing to work locally for language rights and religious freedom and against caste-based discrimination. He was always on the move, visiting old friends and making new ones, first on his old-school bicycle and later on foot when a botched knee surgery left him unable to pedal. Friends and cousins reported running into him all across the city, wearing one of his signature khaki short-sleeve bush shirts. He wrote, he educated, he agitated, but more importantly, he read a lot, all the time. Truly a Renaissance man, his thirst for knowledge and new experiences did not diminish even in his last days.\n\nIn his later years, he became disillusioned with the political class, including his comrades who went on to rule the country. However, he never stopped engaging with the system. He cast his last ballot in 2013 for the second Constituent Assembly. He would not have liked the Constitution pushed through in the wake of the 2015 earthquake that shook Nepal, particularly the reactionary definition of secularism. But by then, he was no longer with us.\n\nIf he were alive, we would have had many looping conversations about the power and symbolism of voting, about vote trading between Democrats and Greens, about patriarchy and racism, and why the Dakota Access Pipeline did not rise up to become an election issue. He would have been glued to the television and probably yelled at every mention of Trump, as he did about Modi during the election in India two and a half years earlier. Although he spent almost all his life in Kathmandu, he fancied himself a global citizen and had strong opinions about the way the world was. We would not have always agreed and would have argued well into the night. But we would have both enjoyed the conversations.\n\nEvery day, I miss talking to my father and on certain days, I feel it more. Our conversations are now no longer possible, except in my head. So, I choose the next best alternative. I follow his footsteps, and cast my vote in his honor for putting his life in line for people’s right to vote and for teaching me that voting is not just my right but also my responsibility. I vote knowing its limitations. I vote hoping for its full potential.\n\nEvery time I line up to vote, and often on days in between, I think about that November morning. I was excited like a child to get an “I Voted” sticker as I exited the polling station. I stuck it on my jacket, took a rare selfie, and thought “Ba, this one’s for you!”","title":"Voting in honor of my father","date":"2020-11-03T06:14:34.000Z","image":"/images/ivoted.jpeg","author":"Luna Ranjit","description":"This is meta description.","categories":[],"tags":["essay","immigrant"],"pinned":false,"first_published_in":false,"publication":"Jacobin","publication_url":"https://jacobinmag.com"}]},"__N_SSG":true}